In [1]:
import pandas as pd

In [4]:
dict = {
    'name': ['Aryaan','Taha','Farrukh'],
    'age': [23,23,43],
    'roll': [23423,435543,754745]
}

df = pd.DataFrame(dict)
df

      name  age    roll
0   Aryaan   23   23423
1     Taha   23  435543
2  Farrukh   43  754745

In [5]:
obj = [
    {'name': 'Aryaan','age':23,'roll':324234},
    {'name': 'Taha','age':23,'roll':324234},
    {'name': 'Farrukh','age':43,'roll':324234},
]

df = pd.DataFrame(obj)
df

      name  age    roll
0   Aryaan   23  324234
1     Taha   23  324234
2  Farrukh   43  324234

In [6]:
multi_list = [
    ['Aryaan',23,23452342],
    ['Taha',23,56643634],
    ['Farrukh',43,6654645645]
]

df = pd.DataFrame(multi_list,columns=['name','age','roll'])
df

      name  age        roll
0   Aryaan   23    23452342
1     Taha   23    56643634
2  Farrukh   43  6654645645